renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/api/private/aws_cellular_psm_config.c
/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2022 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name    : aws_cellular_psm_config.c
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include "r_aws_cellular_if.h"

/**********************************************************************************************************************
 * Macro definitions
 *********************************************************************************************************************/
#define RM_PSM_PHASE_1    (0x01U << 0)
#define RM_PSM_PHASE_2    (0x01U << 1)
#define RM_PSM_PHASE_3    (0x01U << 2)
#define RM_PSM_PHASE_4    (0x01U << 3)
#define RM_PSM_PHASE_5    (0x01U << 4)
#define RM_PSM_PHASE_6    (0x01U << 5)

/**********************************************************************************************************************
 * Typedef definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Exported global variables
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Private (static) variables and functions
 *********************************************************************************************************************/
static void ring_thread (void * const p_pvParameters);

/*************************************************************************************************
 * Function Name  @fn            aws_cellular_psm_config
 ************************************************************************************************/
CellularError_t aws_cellular_psm_config(CellularContext_t * p_context, const uint8_t mode)
{
    st_aws_cellular_ctrl_t * p_aws_ctrl = (st_aws_cellular_ctrl_t *)p_context->pModueContext;   //cast

    CellularError_t     cellularStatus = CELLULAR_UNKNOWN;
    CellularPktStatus_t pktStatus      = CELLULAR_PKT_STATUS_OK;

    bool       status     = false;
    uint8_t    cmdBuf[32] = {'\0'};
    uint8_t    phase      = 0;
    BaseType_t rtos_ret   = pdFALSE;

    CellularAtReq_t atReqpsmconfig =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    if (1 == mode)
    {
        (void) snprintf((char *)cmdBuf, CELLULAR_AT_CMD_MAX_SIZE,   //cast
                        "AT+SQNRICFG=2,3,%d", AWS_CELLULAR_CFG_RING_LINE_ACTIVE_TIME);

        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqpsmconfig);

        if (CELLULAR_PKT_STATUS_OK != pktStatus)
        {
            LogError(("Cellular_SetPsmSettings: couldn't resolve ring line config"));
        }
        else
        {
            phase |= RM_PSM_PHASE_1;
        }

        if (CELLULAR_PKT_STATUS_OK == pktStatus)
        {
            (void) snprintf((char *)cmdBuf, CELLULAR_AT_CMD_MAX_SIZE,   //cast
                            "AT+SQNIPSCFG=1,%d", AWS_CELLULAR_CFG_PSM_PREPARATION_TIME);

            pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqpsmconfig);

            if (CELLULAR_PKT_STATUS_OK != pktStatus)
            {
                LogError(("Cellular_SetPsmSettings: couldn't resolve ring line config"));
            }
            else
            {
                phase |= RM_PSM_PHASE_2;
            }
        }

        if (CELLULAR_PKT_STATUS_OK == pktStatus)
        {
            (void) snprintf((char *)cmdBuf, CELLULAR_AT_CMD_MAX_SIZE,   //cast
                            "AT+SQNPSCFG=%d", AWS_CELLULAR_CFG_PSM_WAKEUP_LATENCY);

            pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqpsmconfig);

            if (CELLULAR_PKT_STATUS_OK != pktStatus)
            {
                LogError(("Cellular_SetPsmSettings: couldn't resolve ring line config"));
            }
        }

        if (CELLULAR_PKT_STATUS_OK == pktStatus)
        {
            p_aws_ctrl->ring_event = PlatformEventGroup_Create();
            if (NULL != p_aws_ctrl->ring_event)
            {
                phase |= RM_PSM_PHASE_3;
            }
        }

        if (NULL != p_aws_ctrl->ring_event)
        {
            p_aws_ctrl->rts_semaphore = xSemaphoreCreateMutex();
            if (NULL != p_aws_ctrl->rts_semaphore)
            {
                phase |= RM_PSM_PHASE_4;
            }
        }

        if (NULL != p_aws_ctrl->rts_semaphore)
        {
            rtos_ret = xTaskCreate((TaskFunction_t)ring_thread,                     //cast
                                    "aws_cellular_ring_thread",
                                    (configSTACK_DEPTH_TYPE)512,                    //cast
                                    (void *)p_context,                              //cast
                                    6,
                                    (TaskHandle_t *)p_aws_ctrl->ring_taskhandle);   //cast
            if (pdFAIL != rtos_ret)
            {
                phase |= RM_PSM_PHASE_5;
            }
        }

        if (pdFAIL != rtos_ret)
        {
            status = aws_cellular_irq_open(p_aws_ctrl);
            if (false != status)
            {
                phase         |= RM_PSM_PHASE_6;
                cellularStatus = CELLULAR_SUCCESS;
            }
        }

