renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/api/private/aws_cellular_psm_config.c
        if (true != status)
        {
            aws_cellular_psm_conf_fail(p_context, phase);
        }
    }
    else
    {
        (void) snprintf((char *)cmdBuf, CELLULAR_AT_CMD_MAX_SIZE,   //cast
                        "AT+SQNRICFG=0,3,%d", AWS_CELLULAR_CFG_RING_LINE_ACTIVE_TIME);

        pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqpsmconfig);

        if (CELLULAR_PKT_STATUS_OK == pktStatus)
        {
            (void) snprintf((char *)cmdBuf, CELLULAR_AT_CMD_MAX_SIZE,   //cast
                            "AT+SQNIPSCFG=0,%d", AWS_CELLULAR_CFG_PSM_PREPARATION_TIME);

            pktStatus = _Cellular_AtcmdRequestWithCallback(p_context, atReqpsmconfig);
        }

        aws_cellular_irq_close(p_aws_ctrl);

        if (NULL != p_aws_ctrl->ring_taskhandle)
        {
            vTaskSuspend((TaskHandle_t)p_aws_ctrl->ring_taskhandle);    //cast
            vTaskDelete((TaskHandle_t)p_aws_ctrl->ring_taskhandle);     //cast
            p_aws_ctrl->ring_taskhandle = NULL;
        }

        if (NULL != p_aws_ctrl->rts_semaphore)
        {
            vSemaphoreDelete(p_aws_ctrl->rts_semaphore);
            p_aws_ctrl->rts_semaphore = NULL;
        }

        if (NULL != p_aws_ctrl->ring_event)
        {
            PlatformEventGroup_Delete(p_aws_ctrl->ring_event);
            p_aws_ctrl->ring_event = NULL;
        }

        cellularStatus = CELLULAR_SUCCESS;

        p_aws_ctrl->psm_mode = 0;

#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 1
        aws_cellular_rts_hw_flow_enable();
#else
        aws_cellular_rts_ctrl(0);
#endif
#ifdef AWS_CELLULAR_RTS_DELAY
        Platform_Delay(AWS_CELLULAR_RTS_DELAYTIME);
#endif
    }

    return cellularStatus;
}
/**********************************************************************************************************************
 * End of function aws_cellular_psm_config
 *********************************************************************************************************************/

/*************************************************************************************************
 * Function Name  @fn            aws_cellular_psm_conf_fail
 ************************************************************************************************/
void aws_cellular_psm_conf_fail(CellularContext_t * p_context, const uint8_t phase)
{
    st_aws_cellular_ctrl_t * p_aws_ctrl = (st_aws_cellular_ctrl_t *)p_context->pModueContext;   //cast

    uint8_t    cmdBuf[32] = {'\0'};

    CellularAtReq_t atReqpsmconfig =
    {
        (char *)cmdBuf, //cast
        CELLULAR_AT_NO_RESULT,
        NULL,
        NULL,
        NULL,
        0,
    };

    if ((phase & RM_PSM_PHASE_6) == RM_PSM_PHASE_6)
    {
        aws_cellular_irq_close(p_aws_ctrl);
    }

    if ((phase & RM_PSM_PHASE_5) == RM_PSM_PHASE_5)
    {
        vTaskSuspend((TaskHandle_t)p_aws_ctrl->ring_taskhandle);    //cast
        vTaskDelete((TaskHandle_t)p_aws_ctrl->ring_taskhandle);     //cast
        p_aws_ctrl->ring_taskhandle = NULL;
    }

    if ((phase & RM_PSM_PHASE_4) == RM_PSM_PHASE_4)
    {
        vSemaphoreDelete(p_aws_ctrl->rts_semaphore);
        p_aws_ctrl->rts_semaphore = NULL;
    }

    if ((phase & RM_PSM_PHASE_3) == RM_PSM_PHASE_3)
    {
        PlatformEventGroup_Delete(p_aws_ctrl->ring_event);
        p_aws_ctrl->ring_event = NULL;
    }

    if ((phase & RM_PSM_PHASE_2) == RM_PSM_PHASE_2)
    {
        (void) snprintf((char *)cmdBuf, CELLULAR_AT_CMD_MAX_SIZE,   //cast
                        "AT+SQNIPSCFG=0,%d", AWS_CELLULAR_CFG_PSM_PREPARATION_TIME);

        _Cellular_AtcmdRequestWithCallback(p_context, atReqpsmconfig);
    }

    if ((phase & RM_PSM_PHASE_1) == RM_PSM_PHASE_1)
    {
        (void) snprintf((char *)cmdBuf, CELLULAR_AT_CMD_MAX_SIZE,   //cast
                        "AT+SQNRICFG=0,3,%d", AWS_CELLULAR_CFG_RING_LINE_ACTIVE_TIME);

        _Cellular_AtcmdRequestWithCallback(p_context, atReqpsmconfig);
    }

    return;
}
/**********************************************************************************************************************
 * End of function aws_cellular_psm_conf_fail
 *********************************************************************************************************************/

/*************************************************************************************************
 * Function Name  @fn            ring_thread
 ************************************************************************************************/
static void ring_thread(void * const p_pvParameters)
{
    CellularContext_t      * p_context  = (CellularContext_t *)p_pvParameters;                  //cast
    st_aws_cellular_ctrl_t * p_aws_ctrl = (st_aws_cellular_ctrl_t *)p_context->pModueContext;   //cast

    st_aws_cellular_timeout_ctrl_t timeout_ctrl;

    bool status = false;

    while (1)
    {
        if (NULL != p_aws_ctrl->ring_event)
        {
            (PlatformEventGroup_EventBits)PlatformEventGroup_WaitBits((PlatformEventGroupHandle_t )p_aws_ctrl->ring_event,
                                                                        1,
                                                                        pdTRUE,
                                                                        pdTRUE,
                                                                        portMAX_DELAY);

            aws_cellular_timeout_init(&timeout_ctrl, AWS_CELLULAR_CFG_RING_LINE_ACTIVE_TIME);
#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 1
            aws_cellular_rts_hw_flow_enable();
#else
            aws_cellular_rts_ctrl(0);
#endif

            while (1)
            {
                status = aws_cellular_check_timeout(&timeout_ctrl);
                if (true == status)
                {
                    break;
                }
            }

            xSemaphoreTake((SemaphoreHandle_t)p_aws_ctrl->rts_semaphore, portMAX_DELAY);
#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 1
            aws_cellular_rts_hw_flow_disable();
#endif
            aws_cellular_rts_ctrl(1);
            xSemaphoreGive((SemaphoreHandle_t)p_aws_ctrl->rts_semaphore);
        }
        else
        {
            Platform_Delay(1);  //cast
        }
    }
}
/**********************************************************************************************************************
 * End of function ring_thread
 *********************************************************************************************************************/

/*************************************************************************************************
 * Function Name  @fn            aws_cellular_irq_callback
 ************************************************************************************************/
void aws_cellular_irq_callback(void * const p_Args)
{
    (void)p_Args;

    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    BaseType_t xResult                  = pdFALSE;

    xResult = PlatformEventGroup_SetBitsFromISR(g_aws_cellular_ctrl.ring_event,
                                                1,
                                                &xHigherPriorityTaskWoken);

    if (pdTRUE == xResult)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
}
/**********************************************************************************************************************
 * End of function aws_cellular_irq_callback
 *********************************************************************************************************************/

/*************************************************************************************************
 * Function Name  @fn            aws_cellular_irq_open
 ************************************************************************************************/
bool aws_cellular_irq_open(st_aws_cellular_ctrl_t * const p_aws_ctrl)
{
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
    return true;
#else
    irq_err_t irq_ret = IRQ_SUCCESS;
    bool      status  = true;

    irq_ret = R_IRQ_Open((irq_number_t)AWS_CELLULAR_CFG_IRQ_NUM,    //cast
                            IRQ_TRIG_FALLING,
                            IRQ_PRI_1,
                            &p_aws_ctrl->ring_irqhandle,
                            aws_cellular_irq_callback);

