renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/api/private/aws_cellular_psm_config.c
    if (IRQ_SUCCESS != irq_ret)
    {
        status = false;
    }
    else
    {
        R_ICU_PinSet();
    }

    return status;
#endif /* defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL) */
}
/**********************************************************************************************************************
 * End of function aws_cellular_irq_open
 *********************************************************************************************************************/

/*************************************************************************************************
 * Function Name  @fn            aws_cellular_irq_close
 ************************************************************************************************/
void aws_cellular_irq_close(st_aws_cellular_ctrl_t * const p_aws_ctrl)
{
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
    R_IRQ_Close(p_aws_ctrl->ring_irqhandle);
    return;
#endif /* #if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__) */
}
/**********************************************************************************************************************
 * End of function aws_cellular_irq_close
 *********************************************************************************************************************/

/*************************************************************************************************
 * Function Name  @fn            aws_cellular_timeout_init
 ************************************************************************************************/
void aws_cellular_timeout_init(st_aws_cellular_timeout_ctrl_t * timeout_ctrl, uint32_t timeout)
{
    timeout_ctrl->over_flg    = 0;
    timeout_ctrl->timeout_flg = 0;
    timeout_ctrl->start_time  = pdMS_TO_TICKS(xTaskGetTickCount());
    timeout_ctrl->end_time    = timeout_ctrl->start_time + timeout;

    if (timeout_ctrl->end_time < timeout_ctrl->start_time)
    {
        timeout_ctrl->over_flg = 1;
    }

    return;
}
/**********************************************************************************************************************
 * End of function aws_cellular_timeout_init
 *********************************************************************************************************************/

/*************************************************************************************************
 * Function Name  @fn            aws_cellular_check_timeout
 ************************************************************************************************/
bool aws_cellular_check_timeout(st_aws_cellular_timeout_ctrl_t * const timeout_ctrl)
{
    uint32_t this_time = pdMS_TO_TICKS(xTaskGetTickCount());
    bool     status    = false;

    if (1 == timeout_ctrl->over_flg)
    {
        if ((this_time >= timeout_ctrl->end_time) ||
                (this_time < timeout_ctrl->start_time))
        {
            status = true;
        }
    }
    else
    {
        if (((this_time > timeout_ctrl->start_time) &&
                (this_time >= timeout_ctrl->end_time)) ||
                (this_time < timeout_ctrl->start_time))
        {
            status = true;
        }
    }

    Platform_Delay(1);  //cast

    return status;
}
/**********************************************************************************************************************
 * End of function aws_cellular_check_timeout
 *********************************************************************************************************************/

/*************************************************************************************************
 * Function Name  @fn            aws_cellular_rts_ctrl
 ************************************************************************************************/
void aws_cellular_rts_ctrl(const uint8_t lowhigh)
{
    AWS_CELLULAR_SET_PODR(AWS_CELLULAR_CFG_RTS_PORT, AWS_CELLULAR_CFG_RTS_PIN) = lowhigh;
}
/**********************************************************************************************************************
 * End of function aws_cellular_rts_ctrl
 *********************************************************************************************************************/

#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 1
/*************************************************************************************************
 * Function Name  @fn            aws_cellular_rts_hw_flow_enable
 ************************************************************************************************/
void aws_cellular_rts_hw_flow_enable(void)
{
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_MPC);
    AWS_CELLULAR_SET_PODR(AWS_CELLULAR_CFG_RTS_PORT, AWS_CELLULAR_CFG_RTS_PIN) = 0;
    AWS_CELLULAR_SET_PDR(AWS_CELLULAR_CFG_RTS_PORT, AWS_CELLULAR_CFG_RTS_PIN)  = 0;
    AWS_CELLULAR_SET_PFS(AWS_CELLULAR_CFG_RTS_PORT, AWS_CELLULAR_CFG_RTS_PIN)  = AWS_CELLULAR_CFG_PFS_SET_VALUE;
    AWS_CELLULAR_SET_PMR(AWS_CELLULAR_CFG_RTS_PORT, AWS_CELLULAR_CFG_RTS_PIN)  = 1;
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC);
}
/**********************************************************************************************************************
 * End of function aws_cellular_rts_hw_flow_enable
 *********************************************************************************************************************/

/*************************************************************************************************
 * Function Name  @fn            aws_cellular_rts_hw_flow_disable
 ************************************************************************************************/
void aws_cellular_rts_hw_flow_disable(void)
{
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_MPC);
    AWS_CELLULAR_SET_PFS(AWS_CELLULAR_CFG_RTS_PORT, AWS_CELLULAR_CFG_RTS_PIN) = 0x00U;
    AWS_CELLULAR_SET_PMR(AWS_CELLULAR_CFG_RTS_PORT, AWS_CELLULAR_CFG_RTS_PIN) = 0;
    AWS_CELLULAR_SET_PDR(AWS_CELLULAR_CFG_RTS_PORT, AWS_CELLULAR_CFG_RTS_PIN) = 1;
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC);
}
/**********************************************************************************************************************
 * End of function aws_cellular_rts_hw_flow_disable
 *********************************************************************************************************************/
#endif  /* AWS_CELLULAR_CFG_CTS_SW_CTRL == 1 */

/*************************************************************************************************
 * Function Name  @fn            aws_cellular_rts_active
 ************************************************************************************************/
void aws_cellular_rts_active(CellularContext_t * p_context, BaseType_t semaphore_ret)
{
    st_aws_cellular_ctrl_t * p_aws_ctrl = (st_aws_cellular_ctrl_t *)p_context->pModueContext;   //cast

    if ((1 == p_aws_ctrl->psm_mode) && (pdTRUE == semaphore_ret))
    {
#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 1
        aws_cellular_rts_hw_flow_disable();
#endif
        aws_cellular_rts_ctrl(1);
        xSemaphoreGive((SemaphoreHandle_t)p_aws_ctrl->rts_semaphore);
    }

    return;
}
/**********************************************************************************************************************
 * End of function aws_cellular_rts_active
 *********************************************************************************************************************/

/*************************************************************************************************
 * Function Name  @fn            aws_cellular_rts_deactive
 ************************************************************************************************/
BaseType_t aws_cellular_rts_deactive(CellularContext_t * p_context)
{
    BaseType_t               semaphore_ret = pdFALSE;
    st_aws_cellular_ctrl_t * p_aws_ctrl    = (st_aws_cellular_ctrl_t *)p_context->pModueContext;   //cast

    if (1 == p_aws_ctrl->psm_mode)
    {
        semaphore_ret = xSemaphoreTake((SemaphoreHandle_t)p_aws_ctrl->rts_semaphore,
                                        pdMS_TO_TICKS(AWS_CELLULAR_SEMAPHORE_BLOCK_TIME));
        if (pdTRUE == semaphore_ret)
        {
#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 1
            aws_cellular_rts_hw_flow_enable();
#else
            aws_cellular_rts_ctrl(0);
#endif
#ifdef AWS_CELLULAR_RTS_DELAY
            vTaskDelay(AWS_CELLULAR_RTS_DELAYTIME);
#endif
        }
    }

    return semaphore_ret;
}
/**********************************************************************************************************************
 * End of function aws_cellular_rts_deactive
 *********************************************************************************************************************/
